Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །བཀའ་མཆིད་སྣ་ཚོགས་ལྷན་ཅིག་མཛད།
en: And you have given us a lot of advice,

source: །དེ་ཡི་སྒྱུ་ནི་མ་བསླབས་སམ།
en: But have you not learned about his magic?”

source: །བདུད་ཀྱིས་སླར་སྨྲས་པ།
en: Māra replied:

source: །དགེ་སྦྱོང་གཽ་ཏམ་བརྟན་པ་ཡིན།
en: “The sage Gautama is clever.

source: །རང་བཞིན་མཁས་པ་ཆེན་པོ་སྟེ།
en: He naturally has great skills,

source: །སྟོང་པའི་ཆོས་ལ་ཡང་དག་ཞུགས།
en: And he has penetrated the meaning of empty phenomena.

source: །རྒལ་ནས་སྐྱེ་དགུ་སྒྲལ་བར་བྱེད།
en: Having crossed over, he is now freeing beings.”

source: །མུན་བྲལ་མས་སྨྲས་པ།
en: Free of Darkness said:

source: སྟོང་པ་ལ་ནི་གང་ཞུགས་པ།
en: “Someone who has penetrated the meaning of emptiness

source: །བདུད་རྣམས་བྱེ་བས་མི་བསྐྱོད་དེ།
en: Cannot be shaken by ten million māras.

source: །བྱང་གྲོལ་བདེ་བ་སྦྱིན་བགྱིད་པ། །དེ་ལ་བདག་ནི་སྐྱབས་སུ་མཆི།
en: I go for refuge In the one who bestows the happiness of emancipation!

source: །མཚན་ཉིད་མ་མཆིས་ལྡན་པ་ཡི། །དེ་བཞིན་ཉིད་ལ་གང་རྟེན་ཅིང་། །ཡེ་ཤེས་ཀྱི་ནི་ཕ་རོལ་ཕྱིན། །དེ་ལ་བདག་ནི་སྐྱབས་སུ་མཆིས།
en: “I go for refuge In the one who indulges in suchness Devoid of characteristics And has mastered wisdom!

source: །སྒྱུ་དེ་བདག་གིས་བསླབ་པར་བགྱི། །སེམས་ཅན་ཐམས་ཅད་རྣམ་པར་དགྲོལ།
en: “I will learn his magic And liberate all beings!

source: །ཆོས་རྣམས་ཀུན་ལ་དབང་སྒྱུར་བའི། །བླ་མེད་སངས་རྒྱས་འགྲུབ་པར་ཤོག །
en: May everyone achieve unsurpassed buddhahood In which all phenomena are mastered!”

source: བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་སྙེད་བདུད་ཀྱི་གནས་དེར་འཁོད་ནས་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པར་གྱུར་ཏེ།
en: All the five hundred daughters of Māra then assembled in that abode of Māra and made aspirations to reach awakening.

source: བདུད་སྡིག་ཅན་ཤས་ཆེར་འཁྲུགས་ཤིང་དངངས་ཏེ་རྨོངས་ནས་སྟོབས་ཀྱི་ཤུགས་ཀྱིས་འཆག་སར་ཞུགས་ཏེ།
en: The evil Māra became exceedingly distressed, frightened, and confused. With great energy, he began to walk away.

source: བདུད་ཀྱི་སྟོབས་ཀྱི་ཤུགས་ཀྱི་ཆོ་འཕྲུལ་གྱིས་བྱིན་གྱིས་བརླབ་པ་དེ་ལྟ་བུ་བྱིན་གྱིས་བརླབས་སོ། །གང་གིས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་དེ་ནས་སོང་ནས་རིང་པོ་མ་ལོན་པར་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་དེར་བདུད་ཀྱི་གནས་དེ་ནས་ནམ་མཁའ་ལས་རྡོའི་ཆར་པ་མེ་རབ་ཏུ་འབར་བའི་ཆར་མངོན་པར་རབ་ཏུ་དབབ་པར་བརྩམས་ཏེ།
en: However, not long after the sage Jyotīrasa had left, Māra, through his demonic magical powers, produced a rain of burning stones that fell from his demonic abode in the sky onto that sacred site of wise sages.

source: ཀླུ་ཐམས་ཅད་ཐལ་བར་རླག་པར་འདོད་ན།
en: He did so with the wish to crush all the nāgas.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་དེར་མེ་ཏོག་གི་ཆར་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་བབ་སྟེ། ཀླུ་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་གྱུར་ཏོ།
en: Nevertheless, through the power of the Blessed One, it turned into a rain of flowers instead, which only brought great delight to all the nāgas.

source: །དགའ་ཁྱབ་མས་སྨྲས་པ།
en: Filled with Joy then said,

source: ཀྱེ་བདུད་ཀྱི་བུ་མོ་དག་ཁྱེད་ལྟོས་ཤིག །འཛམ་བུའི་གླིང་དེར་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་ཀླུ་གང་དག་སྐྱབས་སུ་དོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་འདི་སྡུག་བསྔལ་མང་པོས་གནོད་པར་བྱེད་ན་གང་དག་འདིར་འཁོད་ནས་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་སྐྱབས་སུ་དོང་བ་རང་གི་བུ་མོ་ཁྱེད་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “O daughters of Māra, look! Even those nāgas who have gone for refuge in the spiritual practitioner Gautama in Jambudvīpa are harmed by many miseries, so there is no need to mention you, girls, who stay here and go for refuge in him!”

source: བདུད་ཀྱི་བུ་མོས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The daughters of Māra replied:

source: སངས་རྒྱས་སྐྱབས་སུ་སེམས་ཅན་སུ་འགྲོ་བ། །བདུད་རྣམས་བྱེ་བས་གསད་པར་མི་ནུས་ཏེ།
en: “Even ten million māras are unable to kill Those who take refuge in the Buddha.

source: །ཚུལ་ཁྲིམས་ཉམས་ཤིང་བློ་ནི་འཁྲུགས་ཟིན་ཀྱང་།
en: Even if their discipline is corrupt and their minds are disturbed,

source: །དེ་ནི་ངེས་པར་སྐྱེ་བའི་ཕ་རོལ་འགྲོ།
en: They will definitely transcend birth.

source: །སྟོན་པ་ལ་ནི་མེ་ཏོག་གཅིག་གཏོར་ཞིང་། །བྱང་ཆུབ་སྨོན་ལམ་བརྟན་པོ་བསྐྱེད་པས་ན། །དེ་ནི་བདུད་རྣམས་དུ་མས་གསད་མི་ནུས།
en: “Even a multitude of māras are unable to kill Those who toss a single flower to the Teacher While making the firm aspiration to reach awakening.

source: །ནེམ་ནུར་མེད་པར་འཇིག་རྟེན་སངས་རྒྱས་འགྱུར།
en: Without doubt, they will become buddhas within the world.

source: །དེ་ཡིས་བསླབ་པའི་གཞི་ནི་གཅིག་བླངས་ཤིང་།
en: “Those who take up a single fundamental precept,

source: །ཚིག་གི་དོན་གཅིག་ཙམ་ཡང་ཉན་བྱེད་ལ།
en: Contemplate the meaning of even just one of his words,

source: །བྱང་ཆུབ་ཕྱིར་ནི་སེམས་ཀྱང་བསྐྱེད་པ་དེ།
en: And give rise to the mind set on awakening

source: །སེམས་ཅན་ཁ་ལོ་སྒྱུར་འགྱུར་ནེམ་ནུར་མེད།
en: Will definitely become leaders of sentient beings.

source: །ཡབ་ཀླུ་ཚོགས་འདི་མཐོང་སྟེ་སངས་རྒྱས་ཀྱིས།
en: “Father, when the Buddha saw this group of nāgas,

source: །དེར་ནི་མེ་ཏོག་ཆར་པ་སྣ་ཚོགས་འབེབས།
en: He caused various rains of flowers to fall on their place.

source: །སངས་རྒྱས་ཡུལ་གཅིག་གིས་ནི་ཁྱོད་ལ་བསྔོས། །དེར་ནི་ཅི་ཡང་ནུས་པར་མ་གྱུར་ཏོ།
en: With his single Buddha domain, he has dedicated this to you. There is nothing that could have been done there!

source: །གང་གིས་སེམས་ཅན་དེ་དག་སྡིག་ཟད་ཅིང་། །བདག་ཅག་གི་ནི་ལས་ཀྱི་སྒྲིབ་འབྱང་བ། །ཆེད་དུ་ལུང་བསྟན་པ་ནི་དེར་ཉན་པའི། །རིག་པ་གཅིག་ཀྱང་དེར་ནི་སྟོན་པས་གསུངས། །
en: “In that place, the Teacher revealed A teaching that, when heard a single time, Will exhaust the negative deeds of those beings And purify our karmic obscurations.”

source: དེ་ནས་བདུད་སྡིག་ཅན་ཤས་ཆེར་འཁྲུགས་ཤིང་གཤེ་སྟེ། སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་བ་སྐྱེས་ནས་མྱ་ངན་གྱི་ཁང་པར་གཅིག་པུ་འདུག་གོ།
en: Strongly distressed and criticized, the evil Māra felt miserable and hurt, and so he retired alone to his house to mourn.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མ་ལ་དགའ་བ་བཅོམ་ལྡན་འདས་ཀྱི་ཚངས་པའི་གནས་པ་དམིགས་པ་མེད་པའི་གཏམ་གྱི་ཐ་མར་མཇུག་ཐོགས་སུ་བཅོམ་ལྡན་འདས་བཞུགས་པ་དེར་ཕྱིན་ཏེ་འདུག་གོ། །
en: At that moment, the bodhisattva great being Jyotīrasa arrived where the Blessed One was residing, just as his discourse on the sublime states devoid of reference point was coming to an end.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་ཞེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མ་ལ་དགའ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: He sat down, joined his palms together in the direction of the Blessed One, [. . .] and said to him,

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བགྱིད་པའི་གཟུངས་སྔགས་བཤད་པར་གསོལ། གཟུངས་སྔགས་ཀྱི་གཞི་དེ་དག་གིས་ནི་སྔོན་བདག་ཅག་གཉིས་བྲམ་ཟེའི་ཁྱེའུ་གཉིས་སུ་གྱུར་པ་ན་ལུས་ཀྱི་སླད་དུ་རྒྱལ་པོ་རྒྱལ་གྱི་ལྷ་ལ་ནོངས་པ་བགྱིས་པས་འགུམ་པ་ལ་ཐུག་སྟེ་བཙོན་རར་སྩལ་ནས།
en: “Respected Blessed One, please expound to us the dhāraṇī mantra that focuses attention on the four highest abodes! Concerning this dhāraṇī mantra, in the past, when we were both sons of brāhmaṇas, we committed physical crimes against the king Victorious God and so were sentenced to death.

source: ཟླ་བ་ཕྱེད་ཟས་དང་བྲལ་ཞིང་བཅིང་བ་ལྔས་བཅིངས་ནས་དེ་བཞིན་གཤེགས་པ་མན་དཱ་ར་བའི་བསུང་ལ་ཡིད་ལ་གཞན་མི་སེམས་པར་གསོལ་བ་བཏབ་པ་ལགས་སོ།
en: We were thrown into prison, and for a fortnight we were chained by five shackles and had nothing to eat. We supplicated the thus-gone Mandāravagandha without thinking about anyone else.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་མན་དཱ་ར་བའི་བསུང་བདག་ཅག་ལ་ཐུགས་བརྩེ་བས་རང་གི་གནས་ཀྱི་ཤུལ་ཀར་བཞུགས་ནས་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ལུང་བསྟན་པ་དེ་ལྟ་བུས་བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བགྱིད་པའི་གཟུངས་སྔགས་བསྟན་ཏེ།
en: Then, out of affection for us, the thus-gone Mandāravagandha appeared through a narrow opening in our cell. Through this manifestation of the magical powers of the buddhas’ domains, he taught us the dhāraṇī mantra that focuses the attention on the four highest abodes.

source: སངས་རྒྱས་ཀྱི་མཐུས་བརྩོན་ར་དེར་བདག་ཅག་གི་རྣ་ལམ་དུ་དོན་དང་བཅས། ཚིག་འབྲུ་དང་བཅས་པར་གྲགས་སོ།
en: Through the power of the Buddha, we heard this mantra from inside our cells—both the words and their meaning.

source: །གསང་སྔགས་ཡིད་ལ་བགྱིད་པ་དེ་དག་གིས་བདག་ཅག་དགའ་བ་དང་དད་པ་ཡང་དག་པར་བསྐྱེད་ནས་དེའི་ཚེ་བདག་ཅག་གི་མཐོང་བའི་ཆོས་ལ་མྱོང་བར་འགྱུར་བ་ཐམས་ཅད་དང་། སྐྱེས་ནས་མྱོང་བར་འགྱུར་བ་དང་། ལན་གྲངས་གཞན་ལ་མྱོང་བར་འགྱུར་བ་ཐམས་ཅད་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་དང་། སེམས་ཅན་གྱི་སྒྲིབ་པ་དང་། སྦྱིན་པའི་སྒྲིབ་པ་ཞེས་བགྱི་བ་ནས་ཤེས་རབ་ཀྱི་སྒྲིབ་པ་ཞེས་བྱ་བའི་བར་དང་། ཉེ་བར་སྤྱོད་པ་དང་། ལོངས་སྤྱོད་ཀྱི་སྒྲིབ་པ་དང་། ཚེའི་འདུ་བྱེད་བས་པའི་སྒྲིབ་པ་དང་། བསམས་བཞིན་དུ་སྲིད་པར་སྐྱེ་བའི་སྒྲིབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་རྣམས་སུ་འགྲོ་བའི་སྒྲིབ་པ་ཡོངས་སུ་བས་ཤིང་།
en: By focusing our attention on this mantra, joy and faith arose in our minds. At that moment, all the karmic actions that otherwise would have ripened in our present existence, our next life, and our many subsequent lives was exhausted, as were all our karmic obscurations and our obscurations related to afflictions, phenomena, sentient beings, the perfections from generosity to insight, possessions, enjoyments, the exhaustion of life energy, intentional rebirth in saṃsāra, and going to the pure buddha realms.

source: དེར་བདག་ཅག་བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བགྱིད་པའི་གཟུངས་སྔགས་ཐོས་པ་ཙམ་གྱིས་མོད་ལ་མགྲིན་པ་འཆིང་བ་ལྔ་ལས་གྲོལ་ཏེ། བཙོན་ར་ནས་རྫུ་འཕྲུལ་གྱི་ཡུལ་ཐོབ་པར་གྱུར་ཅིང་།
en: As soon as we heard this dhāraṇī mantra that focuses the attention on the four highest abodes, our necks were released from the five shackles, and we miraculously escaped from our prison.

source: དེ་ནས་ནམ་མཁའ་ལ་ཆས་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མན་དཱ་ར་བའི་བསུང་གི་ཐད་དུ་ཉེ་བར་ཕྱིན་ཏོ།
en: We then flew in the sky and arrived in the presence of the thus-gone Mandāravagandha.

source: །དེ་ནས་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་རི་བོའི་འོད་ཅེས་བགྱི་བར་སྐྱེས་ཏེ།
en: After we passed away, we were born in the buddha realm called Mountain Light.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་མདོག་གི་ཐད་དུ་རབ་ཏུ་བྱུང་ནས་ཞེས་བགྱི་བ་ནས་སླན་ཆད་བསྐལ་པ་དཔག་ཏུ་མ་མཆིས་པར་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་རྣམས་སུ་བདག་ཅག་མ་སྐྱེས་སོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: We became renunciates in front of the blessed thus-gone Cloud Complexion, and for countless eons thereafter we were not born in empty buddha realms.

source: །དེ་བཞིན་དུ་ད་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཐམས་ཅད་དུ་འདི་དང་འོག་མིན་ལ་ཐུག་པའི་བར་གྱིས་ཐམས་ཅད་སེམས་ཅན་མི་དང་མི་མ་ལགས་པ་དཔག་ཏུ་མ་མཆིས་པས་ཁྱབ་སྟེ། དེ་དག་ནི་ལས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་དང་། སེམས་ཅན་གྱི་སྒྲིབ་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཟིན་ཏོ་
en: “Similarly, in this buddha realm of Sahā, everywhere from this place all the way up to the Highest Heaven is now filled with innumerable humans and nonhumans who are afflicted by various types of karmic obscurations and by obscurations related to afflictions, phenomena, and sentient beings.

source: ཞེས་བགྱི་བ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་རྣམས་སུ་ལས་ཡོངས་སུ་མ་དག་པ་དག་གིས་བསྒྲིབས་ཏེ་མཆིས་པར་མི་ནུས་པ་ལགས་སོ་ཞེས་བགྱི་བའི་བར་དུའོ། །སེམས་ཅན་གྱི་ལས་ཀྱི་གཟུངས་སྔགས་ཐོས་མ་ཐག་ཏུ་སེམས་ཅན་རྣམས་ཀྱི་མཐོང་བའི་ཆོས་ལ་མྱོང་བར་འགྱུར་བ་དང་། ལན་གྲངས་གཞན་ལ་མྱོང་བར་འགྱུར་བ་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་དང་། སེམས་ཅན་གྱི་སྒྲིབ་པ་དང་། སྦྱིན་པའི་སྒྲིབ་པ་ཞེས་བགྱི་བ་ནས་ཤེས་རབ་ཀྱི་སྒྲིབ་པ་ཞེས་བྱ་བའི་བར་དང་། ཉེ་བར་སྤྱོད་པ་དང་། ལོངས་སྤྱོད་ཀྱི་སྒྲིབ་པ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་སྒྲིབ་པ་མཆིས་པ་ཐམས་ཅད་དང་། ཐོས་མ་ཐག་ཏུ་སྐྱེ་བའི་སྒྲིབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དག་ཏུ་འགྲོ་བའི་སྒྲིབ་པ་མཆིས་པ་ཐམས་ཅད་ཡོངས་སུ་བས་པར་འགྱུར་བ་དང་།
en: They are obscured by impure actions within pure buddha realms, and so they are unable to escape from their condition. As soon as they hear the dhāraṇī mantra for the karmic actions of sentient beings, all their karmic actions that would otherwise ripen in their present existence and in their subsequent lives will be exhausted, as will all their karmic obscurations and obscurations related to affliction, phenomena, sentient beings, the perfections from generosity to insight, possessions, enjoyments, the paths of the ten virtuous actions, rebirth, and going to the pure buddha realms.

source: ཆོས་བསྟན་པ་དེས་སེམས་ཅན་རྣམས་བཟོད་པ་དང་ཏིང་ངེ་འཛིན་རྣམ་པ་སྣ་ཚོགས་ཐོབ་པར་འགྱུར་བ་དང་། ཇི་སྲིད་འཚོ་བའི་མཐའི་བར་དུ་དེར་འཆི་བའི་དུས་བགྱིས་ནས་སེམས་ཅན་རྣམས་ཇི་ལྟར་བསམ་པ་བཞིན་དུ་སྲིད་པར་སྐྱེ་བ་ལེན་པར་རྔོ་ཐོགས་པར་འགྱུར་བ་དང་། ཚེ་རབས་དྲན་པར་འགྱུར་བ་དང་། རྟག་པར་རྒྱུན་དུ་བརྩོན་འགྲུས་བརྩམས་པ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་ལེན་པ་དང་། ལོག་པར་མི་ལྟུང་བའི་ཆོས་ཅན་རྣམས་སུ་འགྱུར་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་མངོན་པར་བརྩོན་པ་དང་། བསྡུ་བའི་དངོས་པོ་བཞི་ལ་མངོན་པར་བརྩོན་པ་དང་། ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་རིམ་གྲོ་བགྱི་བ་དང་། བསམ་གཏན་གྱིས་རྣམ་པར་རོལ་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཚངས་པའི་གནས་པ་སྒོམ་པ་ལ་མངོན་པར་བརྩོན་པར་འགྱུར་བ་དང་། འགྲོ་བ་ཐམས་ཅད་དུ་བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་ཆོས་དེ་དག་དང་འབྲལ་བར་མི་འགྱུར་བར་བཅོམ་ལྡན་འདས་ད་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་བཙུན་པ་བཅོམ་ལྡན་འདས་བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བགྱིད་པའི་གཟུངས་སྔགས་དེ་ལེགས་པར་བཤད་པར་གསོལ།
en: Through this Dharma teaching, those sentient beings will achieve various degrees of acceptance and absorption. When they finally arrive at the time of death at the ends of their lives, they will be able to intentionally take rebirth in saṃsāra, and they will remember their past lives. They will constantly cultivate diligence and follow the paths of the ten virtuous actions. Without falling into mistaken views, they will exert themselves in the six perfections and in the four means of attracting disciples. They will listen to the Dharma, serve the Saṅgha, revel in the concentrations, develop the higher perceptions, and strive in the cultivation of the sublime states. Respected Blessed One, out of your affection for all sentient beings, please expound to us now the dhāraṇī mantra that focuses the attention on the four highest abodes, so that all those beings may never part from those qualities until they reach unsurpassed and perfect nirvāṇa!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གང་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་ཞུགས་པ་ལེགས་སོ་ལེགས་སོ་ཞེས་བྱ་བ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ཞེས་བྱ་བའི་བར་དུའོ། །དགེ་སློང་ངམ། དགེ་སློང་མའམ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་སུ་ལ་ལ་ཐེག་པ་གསུམ་ལས་ཐེག་པ་གང་ཡང་རུང་བས་སྲིད་པའི་རྒྱ་མཚོ་ལས་རྒལ་བར་འདོད་པ་ནི་མྱུར་དུ་ཐེག་པ་དེ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པ་ཡིན་ལ།
en: The Blessed One replied, “Noble son, your endeavor to benefit many beings is excellent! [. . .] Faithful monks, nuns, and noble sons or daughters who wish to cross the ocean of saṃsāra through any of the three vehicles all want to quickly perfect their individual vehicle.

source: སྡུག་བསྔལ་ཐམས་ཅད་འཇོམས་པར་འདོད་པ་ཡིན། ཐོས་པ་ཐམས་ཅད་ཀུན་ཏུ་འཛིན་པར་འདོད་པ་ཡིན། ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འདོད་པ་ཡིན། བསྟན་པ་བསྲུང་བར་འདོད་པ་ཡིན།
en: They want to overcome all suffering, to retain everything they hear, to be fully liberated from their physical, verbal, and mental negativities, and to protect the teachings.

source: སྙན་པ་འདོད་པ་དང་། རྙེད་པ་འདོད་པ་ཡིན། བཟའ་བ་དང་བཏུང་བ་མང་པོ་འདོད་པ་དང་། དབང་ཕྱུག་འདོད་པ་དང་། གཟུགས་འདོད་པ་དང་། སྟོབས་འདོད་པ་དང་། འཁོར་འདོད་པ་དང་། ནོར་དང་འབྲུ་འདོད་པ་དང་། ཐུ་བོ་འདོད་པ་དང་། མི་དང་མི་མ་ཡིན་ཐམས་ཅད་ཀྱིས་མཆོད་པར་འོས་པར་འདོད་པ་ཡིན། རྟག་ཏུ་ལུས་འདོད་པ་ཡིན། རྟག་ཏུ་ལུས་དང་། ངག་དང་ཡིད་ཀྱིས་ཀུན་ཏུ་གནོད་པར་འདོད་པ་ཡིན་ཞིང་མྱུར་དུ་བསམ་གཏན་དང་།
en: They also want fame, gain, plenty to eat and drink, power, good physique, strength, retinues, wealth and grain, and preeminent positions. They want to be worshiped by all humans and nonhumans. They always have desire for the body, and they always want to control themselves through body, speech, and mind.

source: ཏིང་ངེ་འཛིན་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཚངས་པའི་གནས་པ་དང་། གཟུངས་དང་། བཟོད་པ་རྣམ་པ་སྣ་ཚོགས་བསྒྲུབ་པར་འདོད་པ་ཡིན་ནོ།
en: They want to accomplish the absorptions, the formless attainments, the higher perceptions, the sublime states, the dhāraṇīs, and various types of acceptances.

source: །དེ་ལྟར་ཡང་ལས་ཀྱི་སྒྲིབ་པ་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་ཤས་ཆེར་འཕངས་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྲོ་བའི་སྒྲིབ་པ་རྣམས་ཀྱིས་བསམས་བཞིན་དུ་སྲིད་པར་སྐྱེ་བ་བླངས་པ་དེའི་བར་གྱིས་མྱུར་དུ་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དེ་ལྟ་བུ་དེ་དག་སྒྲུབ་པར་མི་ནུས་ཏེ།
en: However, since they are mainly propelled by their various karmic and afflictive obscurations, and by all the obscurations up to the obscurations related to going to the pure buddha realms and taking intentional rebirth in saṃsāra, they are unable to accomplish the various roots of virtue quickly.

source: ལས་ཀྱི་སྒྲིབ་པ་དེ་ལྟ་བུ་དེ་དག་གིས་ཟིན་པའི་ཕྱིར་རོ།
en: This is because they are afflicted by those karmic obscurations.

source: །གང་ཟག་དེ་ཁྲུས་བྱས་ཏེ་གོས་གཙང་མ་བགོས་ཤིང་། ཁ་ཟས་གཙང་མ་དང་མལ་གཙང་མ་དེར་སྐྱིལ་མོ་ཀྲུང་དམ་འཆགས་པས་ཀྱང་རུང་སྟེ།
en: “Those beings should wash themselves, wear clean clothes, and eat pure food.

source: རྗེས་སུ་འཐུན་པའི་ཚེས་བརྒྱད་ལ་སངས་རྒྱས་ཀྱི་སྐུའི་གཟུགས་ཡིད་ལ་བྱེད་པས་གཞན་ཡིད་ལ་མི་སེམས་པར་ཞེས་བྱ་བ་ནས་ལས་གཞན་མི་བྱེད་ཅིང་སེམས་རྣམ་པར་གཡེངས་པ་མ་ཡིན་པའི་བར་གྱིས་རེ་ཤིག་མཚན་གཅིག་གམ་ཞེས་བྱ་བ་ནས་མཚན་བདུན་གྱི་བར་དུ་གནས་པར་བྱེད་ན་དེས་རང་གི་སྐུ་བྱད་དུ་སངས་རྒྱས་མཐོང་ངོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Then, on the auspicious eighth day of the month, whether they are sitting cross-legged on a clean bed or up walking, if they contemplate the physical form of the Buddha with no other thought or action and with no distraction, they will come to behold the Buddha in his own appearance if they can do this anywhere from one night up to seven nights.

source: །གལ་ཏེ་སངས་རྒྱས་ཀྱི་སྐུའི་གཟུགས་ཆུང་ངུར་རྟོག་པར་བྱེད་ན་ཆུང་ངུ་ཁོ་ནར་མཐོང་ངོ་། །ཡང་ན་ཚད་མེད་པར་རྟོག་པར་བྱེད་ན་གཟུགས་ཀྱི་སྐུ་ཚད་མེད་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: If they think of the Buddha’s body as being small, they will perceive it as being small in the exact same way, and if they think that it is limitless, they will perceive it as being limitless.

source: །དེས་མཚན་ཐོག་ཐག་མཚན་སུམ་ཅུ་རྩ་གཉིས་མཐོང་ངོ་།
en: During the whole night, they will see his thirty-two major marks.

source: །མཚན་གང་ལས་ཁ་དོག་སྔོན་པོའི་འོད་འཕྲོ་བའི་མཚན་གཅིག་པོ་དེ་ཉིད་ལ་ཡིད་ཀྱིས་རྗེས་སུ་བལྟས་ནས་གསང་སྔགས་འདི་དག་བརྗོད་དོ། །
en: While visualizing a single mark from which blue color radiates, they should recite this mantra:

source: ཏདྱ་ཐཱ། བི་ཛྲིམ་བྷུ་བི་ཛྲི་མ་བྷ། ཨུད་པཱ་ད། བྱ་ཡ། བི་ཛྲི་མ་བྷ། སྣ་བ་བ་ར་ཨ་ནུ་ད་ཏ་ཐཱ་ཏཱ་བྷཱུ་ཏ་ཀོ་ཊི་བི་ཛྲིམ་བྷ་སྭཱ་ཧཱ།
en: tadyathā: vijrimbha vijrimabha utpāda vyaya vijrimabha snava vara anudatthātā bhūtakoṭi vijrimabha svāhā.

source: ཇི་སྲིད་དུ་དེས་ཁ་དོག་སྔོན་པོའི་འོད་འཕྲོ་བ་རྣམ་པར་སྤེལ་ནས་དེ་དག་བྱུང་སྟེ།
en: As that blue light radiates and spreads out, it is absorbed into the crowns of their own heads.

source: རང་གི་མགོའི་སྤྱི་བོར་ཞུགས་པ་དེ་སྲིད་དུ་དེས་མཚན་གཅིག་ལ་རྣམ་པར་མི་གཡེང་བའི་ཡིད་ཀྱི་རྗེས་སུ་བལྟས་ནས་ཚིག་འདི་དག་བརྗོད་ཅིང་མི་སྐྲག་པར་བྱ། མི་དངང་བར་བྱའོ།
en: They should then maintain this visualization undistractedly for one night while reciting those words without being scared or frightened.

source: །རང་གི་ལུས་ལ་མེར་རྣམ་པར་བལྟ་བར་བྱ་སྟེ།
en: They should then perceive their bodies as fire.

source: ཇི་ལྟ་ཞེ་ན།
en: How should they do so?

source: དེས་ཁ་དོག་སྔོན་པོའི་འོད་འཕྲོ་བ་རང་གི་ལུས་ཀྱི་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་དུ་འགྲོ་བ་མཐོང་ནས་རང་གི་ལུས་ཐམས་ཅད་རབ་ཏུ་འབར་བར་མཐོང་ངོ་ཞེས་བྱ་བ་ནས་ཐལ་བ་བཞིན་དུ་མཐོང་ངོ་ཞེས་བྱ་བའི་བར་དང་། ཕྱོགས་བཞིར་རླུང་གིས་མ་ལུས་པར་ཁྱེར་བ་སྟོང་པ་བཞིན་དུ་མཐོང་ངོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: They should see that the dazzling blue light penetrates all the major and minor limbs of their bodies and that the whole of their bodies is consumed by blazing fire until it is reduced to ashes. They should then visualize the wind completely blowing the ashes away in the four directions, until everything becomes empty.

source: ཕྱོགས་ཐམས་ཅད་དུ་དེ་ལ་གཟུགས་སྣང་བ་གང་ཡང་མི་འབྱུང་བ་འདི་ནི་དེའི་ཐམས་ཅད་སྒྲུབ་པ་ཡིན་ནོ།
en: When no physical forms appear anymore in any direction, the final accomplishment of that practice is reached.

source: །རིགས་ཀྱི་བུ་སུ་ལ་ལ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དེ་ལྟ་བུའི་བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བྱེད་པའི་གཟུངས་སྔགས་ཤིན་ཏུ་བསྒོམས་ཞིང་མཆོད་སྦྱིན་ལེགས་པར་བྱས་ལ་ཤིན་ཏུ་ཡིད་ལ་བྱས་ན་དེའི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་དང་། ཉོན་མོངས་པའི་སྒྲིབ་པ་དང་། ཆོས་ཀྱི་སྒྲིབ་པ་ཞེས་བྱ་བ་ནས་མ་ལུས་པའི་བར་དུ་ཡོངས་སུ་བྱང་བར་འགྱུར་རོ།
en: Noble son, if beings have thoroughly cultivated this recollection of the Buddha—the dhāraṇī mantra that focuses the attention on the four highest abodes—and properly performed and contemplated this act of worship, all their karmic obscurations, as well as their obscurations related to afflictions and phenomena and all their other obscurations, will be purified.

source: །མཚམས་མེད་པའི་ལས་རྣམས་དང་། དམ་པའི་ཆོས་སྤངས་པ་རྣམས་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་རྣམས་ནི་མ་གཏོགས་སོ།
en: This does not include acts with immediate retribution, the abandonment of the sacred Dharma, and the denigration of the noble ones.

source: །དེ་འདོད་ན་དེ་ལྟར་ཉིན་མཚན་གཅིག་གིས་སངས་རྒྱས་ཀྱི་གསུང་ཐམས་ཅད་དང་། ཕྱི་རོལ་པའི་བསྟན་བཅོས་ཐམས་ཅད་དང་། རིག་པའི་གནས་བཅོ་བརྒྱད་དང་། གཞན་ཡང་གང་དག་སྙན་དངགས་སུ་བྱས་པ་རྣམས་དེས་ཐེ་ཚོམ་མེད་པར་ཤིན་ཏུ་ཀུན་ཏུ་འཛིན་པར་འགྱུར་རོ།
en: “If they want, they will be able to memorize with certainty in a single day and night all the words of the Buddha, all the treatises of the non-Buddhists, the eighteen fields of knowledge, and all the poetic compositions.

source: །དེ་ཉིན་མཚན་གཅིག་གིས་བསམ་གཏན་བཞི་དང་། གོང་མ་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། ཚངས་པའི་གནས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་བསྒོམ་པར་འདོད་ན་དེས་ཤིན་ཏུ་བསྒོམས་པ་ཡིན་ནོ།
en: If they want to cultivate the four concentrations, the higher bases of miraculous displays, the four sublime states, the four correct knowledges, and the four formless attainments, they will be able to become fully trained in them in a single day and night.

source: །དེ་འདོད་ན་སྐད་ཅིག་གཅིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དུས་གསུམ་གྱི་འགྲོ་བའི་འཆི་འཕོ་དང་། སྐྱེ་བ་དང་སེམས་ཀྱི་སྤྱོད་པ་རབ་ཏུ་ཤེས་པར་འགྱུར་རོ། །དེ་འདོད་ན་སྐད་ཅིག་གཅིག་གིས་ནམ་མཁའ་ཐམས་ཅད་རང་གི་ལུས་སམ། སངས་རྒྱས་ཀྱི་སྐུའམ། བརྒྱ་བྱིན་གྱི་བར་རམ། ཚངས་པའི་བར་རམ། སྲེད་མེད་ཀྱི་བུའི་བར་རམ། དབང་ཕྱུག་ཆེན་པོའི་བར་རམ། རྒྱལ་ཆེན་བཞིའི་བར་རམ། འཁོར་ལོས་སྒྱུར་བའི་བར་རམ། ཆུའི་བར་རམ། མེའི་བར་རམ། སའི་བར་གྱིས་གང་བར་བྱེད་དོ། །
en: If they want, they will be able to clearly know in a single instant all the deaths, rebirths, and mental activities of all beings in the three times. If they want, they will be able to fill the entirety of space in a single instant with their own bodies, with the bodies of buddhas, Śakra, Brahmā, Nārāyaṇa, Maheśvara, the Four Great Kings, or universal monarchs, or with water, fire, or earth.

source: དེ་འདོད་ན་སྐད་ཅིག་གཅིག་གིས་ནམ་མཁའ་ཐམས་ཅད་མེ་ཏོག་གི་བར་དང་། རིན་པོ་ཆེའི་ཕྲེང་བ་དང་། སྤོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རས་བཅོས་བུ་དང་། ཆོས་གོས་དང་། རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཀྱི་བར་དག་གིས་གང་བར་བྱེད་དོ།
en: If they want, they will be able to fill the entirety of space in a single instant with all kinds of flowers, garlands of gems, perfumes, parasols, banners, flags, fine fabrics, Dharma robes, and ornaments.

source: །སུས་བཞི་པ་རབ་ཀྱི་མཐའ་གནས་ཡིད་ལ་བྱེད་པ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དེ་ལྟ་བུ་ཤིན་ཏུ་བསྒོམས་པ་ཡིན་ཞིང་ཤིན་ཏུ་འདྲེས་པར་བྱས་ལ་ཤིན་ཏུ་ཡིད་ལ་བྱས་པ་ཡིན་པ་དེའི་ལས་ཚད་མེད་པ་དེ་ལྟ་བུ་མ་ལུས་པར་བྱང་བར་འགྱུར་རོ།
en: All the limitless karmic actions of those who have thoroughly cultivated, mingled their minds with, and contemplated this recollection of the Buddha that focuses the attention on the four highest abodes will be purified without exception.

source: །དེ་དེ་ལྟར་བསོད་ནམས་དང་། སྟོབས་དང་། བརྩོན་འགྲུས་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། བཟོད་པ་དང་། རྣམ་པར་རོལ་པ་དང་། མངོན་པར་ཤེས་པ་ཚད་མེད་པར་འགྱུར་རོ།
en: Their merit, power, diligence, absorption, retention, acceptance, miraculous displays, and higher perceptions will become limitless.

source: །དེས་དེ་ལྟར་གང་ཡང་རུང་བ་དག་ཡོངས་སུ་རྫོགས་པར་བྱས་ན་མྱུར་དུ་འཁོར་བ་ལས་རྣམ་པར་ཐར་བར་འགྱུར་ཏེ། མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་རྣམས་ནི་མ་གཏོགས་སོ།
en: All those who have perfected this practice in that way will quickly be liberated from saṃsāra—except for those who have committed the acts with immediate retribution, abandoned the sacred Dharma, or denigrated the noble ones.
